Autodesk.Revit.DB.ExternalService.ExternalServiceOptions.SupportActivation
Indicates if the service supports activation/deactivation of the servers.
Remarks:
If this option is set to true servers can be activated/deactivated.
If this option is set to false, for a single-server only one server
can be added(registered) and will be considered active.
In case of a multi-server service multiple servers cand be added(registered) and
all of them will be considered active. An attempt to activate/deactivate the
servers will lead to an exception.
A service for which SupportActivation is set to false, can't be recordable and self-synchronizing.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: A service that doesn't support activation should not be recordable and/or self-syncronizing.
Since:
2024

Autodesk.Revit.DB.ExternalService.ExternalServiceOptions.IsSelfsynchronizing
Indicates whether the service's record of used services (in a particular document)
can independently wary between local clients and the corresponding central model.
It is then up to the service's owner to assure proper local-central synchronization.
Remarks:
This property is ignored unless the service is also recordable.
Declaring a service as self-synchronizing makes the service bypass standard
worksharing checks during local-central synchronizations. What it means is that
should there be any disparity found between the list of servers used in the local
file and those used in the central file, they would get ignored; it would be
assumed that the owner of the service takes other steps to ensure the local and
the central data are in sync.
Few services should need to set this property as True, for self-synchronizing
services are very rare, practically limited only to those which operate on element
level.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: A service that doens't support activation should not be self synchronizing.
Since:
2014

Autodesk.Revit.DB.ExternalService.ExternalServiceOptions.IsRecordable
Indicates whether executions of the service is recorded in documents or not.
Remarks:
When a recordable service is executed in a document, a record about the executed
server (or servers) is stored in the document's history. This allows active servers
to be synchronized next time a saved document is opened in Revit.
Executions of a recordable service in a document must happen inside a transaction.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: A service that doens't support activation should not be recordable.
Since:
2014